IDENTIFICATION DIVISION.
  program-id.  base_jb.


ENVIRONMENT DIVISION.
  INPUT-OUTPUT SECTION.
    FILE-CONTROL.
      SELECT RANDOM_FILE ASSIGN TO 'C:\MYFOLDER\RANDOM.DAT'.
      DATA RECORDS ARE FIXED LENGTH BLOCK CONTAINS 0 RECORDS.
        88 base_2 value 2.

DATA DIVISION.
  FILE SECTION.
    FD RANDOM_FILE.
      01 RANDOM_RECORD PIC X(20).

PROCEDURE DIVISION.
  MAIN-PROCEDURE.
    OPEN INPUT RANDOM_FILE OUTPUT RANDOMONE_FILE.
    DISPLAY 'Program Started!'.

    PERFORM UNTIL EOF-RANDOM-FILE
      MOVE SPACES TO RANDOM_RECORD.
      ** Randomly generate some data **
      ** Randomly generate some data test test test test test**
      ** Randomly **
      ** RandomlyYo Me**
      MOVE RANDOM BETWEEN 10 AND 99 TO RANDOM_RECORD(1:2).
      MOVE RANDOM BETWEEN A AND Z TO RANDOM_RECORD(3).
      DISPLAY RANDOM_RECORD.
      WRITE RANDOM_RECORD.
    END-PERFORM.

    CLOSE RANDOM_FILE.
    DISPLAY 'Program Finished!'.

    STOP RUN.
END PROGRAM RANDOM_PROGRAM.


